app/controllers/carts_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    @cart = current_user.cart
    @cart_items = @cart.cart_items.includes(:product)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 68], ["LIMIT", 1]]
---
  def add
    @cart = current_user.cart
    @product = Product.find(params[:product_id])

    cart_item = @cart.cart_items.find_or_initialize_by(product: @product)