app/controllers/orders_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]
---
  def new
    @cart = current_user.cart
    @cart_items = @cart.cart_items.includes(:product)

    if @cart_items.empty?