app/controllers/products_controller.rb

SELECT 1 AS one FROM "products" WHERE "products"."available" = ? LIMIT ?  [["available", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."available" = ? ORDER BY "products"."created_at" DESC LIMIT ?  [["available", 1], ["LIMIT", 50]]
---
  def index
    @products = Product.available

    # Filtering
    @products = @products.by_rarity(params[:rarity]) if params[:rarity].present?
    @products = @products.by_category(params[:category]) if params[:category].present?

    if params[:min_price].present? && params[:max_price].present?
      @products = @products.price_range(params[:min_price].to_f, params[:max_price].to_f)
    end

    # Sorting
    @products = case params[:sort]
                when 'price_low'
                  @products.order(price: :asc)
                when 'price_high'
                  @products.order(price: :desc)
                when 'name'
                  @products.order(name: :asc)
                else
                  @products.order(created_at: :desc)
                end

    @products = @products.page(params[:page]).per(12) if defined?(Kaminari)
    @products = @products.limit(50) unless defined?(Kaminari)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."available" = ? AND "products"."category" = ? AND "products"."id" != ? LIMIT ?  [["available", 1], ["category", "heavy"], ["id", 34], ["LIMIT", 4]]
---
  def show
    @product = Product.find(params[:id])
    @in_wishlist = logged_in? && current_user.wishlists.exists?(product: @product)
    @related_products = Product.available.where(category: @product.category).where.not(id: @product.id).limit(4)