app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["username", "user1"], ["email", "user1@gmail.com"], ["password_digest", "[FILTERED]"], ["balance", 0.0], ["created_at", "2026-04-07 12:08:32.277545"], ["updated_at", "2026-04-07 12:08:32.277545"]]