app/models/cart.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
---
  def total_price
    cart_items.sum { |item| item.product.price * item.quantity }