app/models/user.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["user_id", 1], ["created_at", "2026-04-07 12:08:32.624733"], ["updated_at", "2026-04-07 12:08:32.624733"]]
---
  def create_cart
    Cart.create(user: self)